Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/vocational_education_and_training/courses_for_long_term_unemployed_people.html.txt.tmx
Source language: en
Languages: ga

source: Momentum is an initiative which provides education and training to assist long-term unemployed people gain the skills needed to access work in sectors of the economy where there are job opportunities
ga: Tionscnamh nua is ea Momentum a chuireann oideachas agus oiliúint ar fáil chun cabhrú le daoine atá dífhostaithe le tréimhse fhada chun na scileanna a theastaíonn a fhoghlaim chun obair a fháil in earnálacha an gheilleagair ina bhfuil deiseanna poist

source: All Momentum education and training projects are free
ga: Tá gach tionscadal oideachais agus oiliúna de chuid Momentum saor in aisce

source: There are full and part-time projects available
ga: Tá tionscadail lánaimseartha agus pháirtaimseartha ar fáil

source: Projects are from level 3 to 6 on the National Framework of Qualifications (NFQ) or to an industry-required certification
ga: Tá na tionscadail idir leibhéal 3 agus 6 ar an gCreat Náisiúnta Cáilíochtaí (NFQ) nó a fhad le deimhniú riachtanach tionscail

source: Momentum will provide eligible jobseekers with:
ga: Cuirfidh Momentum an méid a leanas ar fáil do chuardaitheoirí incháilithe poist:

source: • Access to a range of quality education and training projects
ga: • Rochtain ar réimse tionscadail ardchaighdeáin oideachais agus oiliúna

source: • Links to identified job vacancies and employers
ga: • Naisc le folúntais a sainaithníodh agus le fostóirí

source: • Work placement and support
ga: • Socrúchán oibre agus tacaíocht

source: • Industry and NFQ (National Framework of Qualifications) Certification
ga: • Deimhniú Tionscail agus an NFQ (an Creat Náisiúnta Cáilíochtaí)

source: Some Momentum projects are specifically for unemployed people under 25 years of age
ga: Tá roinnt tionscadail Momentum deartha go sonrach do dhaoine dífhostaithe faoi bhun 25 bliain d’aois

source: If Momentum doesn’t meet your needs, there are several other ways to access education and training
ga: Mura ndéanann Momentum freastal ar do chuid riachtanas, tá roinnt bealaí eile ann chun rochtain a fháil ar oideachas agus ar oiliúint

source: The Momentum programme is currently not recruiting for participants
ga: Níl an clár Momentum ag glacadh le rannpháirtithe nua faoi láthair

source: To qualify for a free Momentum project you must be:
ga: Chun cáiliú do thionscadal saor in aisce Momentum:

source: • Unemployed for at least 12 months*
ga: • Ní mór duit bheith dífhostaithe ar feadh 12 mhí ar a laghad

source: • Getting Jobseeker’s Benefit or Jobseeker’s Allowance or signing on for credits for at least 12 months
ga: • Ní mór go bhfuil Sochar Cuardaitheora Poist nó Liúntas Cuardaitheora Poist bheith á fháil agat nó go bhfuil tú ag síniú le haghaidh creidmheasanna le 12 mhí anuas, ar a laghad

source: • Actively seeking work
ga: • Ní mór go bhfuil tú ag cuardach oibre go gníomhach

source: Time spent on a Back to Education Allowance, VTOS, FÁS training course, Fáilte Ireland training course, Youthreach, Community Employment scheme, TUS, Rural Social Scheme, Back to Work Allowance, Back to Enterprise Allowance, Job Initiative and Job Assist may be counted towards meeting the qualifying criteria for a Momentum project
ga: Féadtar am a caitheadh ar an Liúntas um Fhilleadh ar Oideachas, Scéim Deiseanna Oiliúna Gairmoideachais (VTOS), cúrsa oiliúna FÁS, cúrsa oiliúna Fháilte Éireann, Ógtheagmháil, scéim Fostaíochta Pobail, TÚS, an Scéim Shóisialta Tuaithe, an Liúntas um Fhilleadh ar Obair, an Liúntas Fiontraíochta um Fhilleadh ar Obair, Tionscnamh Poist agus Postchúnamh a chur san áireamh chun na critéir cháilitheachta le haghaidh thionscadal Momentum a chomhlíonadh

source: You must have completed the scheme and be signing on or getting a jobseeker’s payment
ga: Ní mór gur chríochnaigh tú an scéim agus go bhfuil tú ag síniú nó go bhfuil íocaíocht chuardaitheora poist á fáil agat

source: You should check your eligibility for a Momentum project with your local employment services office
ga: Ba cheart duit do incháilitheacht le haghaidh thionscadal Momentum a sheiceáil le d’Oifig áitiúil Seirbhísí Fostaíochta

source: Refusing a place on a Momentum project
ga: Áit ar thionscadal Momentum a dhiúltú

source: Your social welfare payment can be reduced if you refuse an appropriate offer of training
ga: Má dhiúltaíonn tú tairiscint chuí oiliúna, d’fhéadfadh go laghdófar d’íocaíocht leasa shóisialaigh

source: Find out more in our documents on Jobseeker’s Allowance and Jobseeker’s Benefit
ga: Faigh amach tuilleadh inár ndoiciméid maidir le Liúntas Cuardaitheora Poist agus Sochar Cuardaitheora Poist

source: You will continue to get your jobseeker’s payment while you are on the project. Momentum participants aged under 26 who move from an age-related reduced rate of Jobseeker’s Allowance will get a top-up rate of €160 per week (any means you have will be deducted from this rate)
ga: Gheobhaidh rannpháirtithe in Momentum atá faoi 26 bliain d’aois a aistríonn ó ráta laghdaithe aoisbhainteach Liúntas Cuardaitheora Poist ráta breisithe €160 sa tseachtain (asbhainfear aon mhaoin atá agat ón ráta)

source: If you no longer meet the qualifying criteria for Jobseeker’s Allowance or Jobseeker’s Benefit your social welfare payment will stop, but you may continue on the Momentum project
ga: Leanfaidh tú le d’íocaíocht chuardaitheora poist a fháil fad atá tú rannpháirteach sa tionscadal

source: If your Jobseeker’s Benefit claim ends while you are on a Momentum project, you can apply for Jobseeker’s Allowance and continue on Momentum regardless of whether your Jobseeker’s Allowance claim is awarded
ga: Más rud é nach gcomhlíonann tú na critéir cháilitheacha le haghaidh Liúntas Cuardaitheora Poist nó Sochar Cuardaitheora Poist, stopfar d’íocaíocht leasa shóisialaigh, ach féadfaidh tú leanúint ar aghaidh le tionscadal Momentum

source: If you are on a full-time Momentum course and you need childcare, you may qualify for a free childcare place under the Childcare Employment and Training Support (CETS) scheme
ga: Más rud é go dtagann d’éileamh Sochar Cuardaitheora Poist chun deiridh agus tú ar thionscadal Momentum, féadfaidh tú iarratas a dhéanamh ar Liúntas Cuardaitheora Poist agus leanúint ar aghaidh le tionscadal Momentum beag beann ar cé acu a bhronntar d’éileamh Liúntas Cuardaitheora Poist nó nach mbronntar

source: Decide on the sector you would like to train in and search for a project
ga: Déan cinneadh ar an earnáil ina mian leat oiliúint a fháil agus cuardaigh tionscadal

source: For more information about a project you can contact the project provider
ga: Chun teacht ar thuilleadh faisnéise faoi thionscadal, féadfaidh tú teagmháil a dhéanamh leis an soláthróir tionscadail

source: Contact your local employment service office to register your interest in a project
ga: Déan teagmháil le d’oifig áitiúil seirbhísí fostaíochta chun do spéis i dtionscadal a chlárú

source: You can register for a maximum of 2 projects at any one time
ga: Féadfaidh tú clárú le haghaidh 2 thionscadal ar a mhéid ag aon tráth amháin

source: If you meet the criteria for your selected project, you will be called 1-2 weeks before the start of the project for a briefing with the provider
ga: Má chomhlíonann tú na critéir do do thionscadal roghnaithe, glaofar ort 1-2 sheachtain sula dtosaíonn an tionscadal chun cruinniú faisnéise a bheith agat leis an soláthróir

source: If you are successful in gaining a place on your chosen project you will receive a letter confirming this and advising you of the start date
ga: Má éiríonn leat áit a fháil ar do thionscadal roghnaithe, gheobhaidh tú litir a dheimhníonn seo agus a chuirfidh tú ar an eolas faoin dáta tosaigh

source: You can also find more information about applying for a project on the Momentum website
ga: Ina theannta sin, féadfaidh tú teacht ar thuilleadh faisnéise faoi iarratas a dhéanamh ar thionscadal ar láithreán gréasáin Momentum

source: Your local employment service office can provide you with any assistance you need to apply for a Momentum project
ga: Féadfaidh d’Oifig áitiúil Seirbhísí Fostaíochta aon chúnamh a theastaíonn uait a thabhairt duit chun iarratas a dhéanamh ar thionscadal Momentum

source: More information is available on momentumskills.ie
ga: Tá fáil ar thuilleadh faisnéise ar momentumskills.ie

source: To apply for a Momentum project contact your local employment services office
ga: Chun iarratas a dhéanamh ar thionscadal Momentum, déan teagmháil le do oifig áitiúil seirbhísí fostaíochta
